# Taps
tap "dart-lang/dart"
tap "facebook/fb"
tap "felangel/mason"
tap "fluttergen/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "leoafarias/fvm"

# Binaries
brew "cocoapods"
brew "fastlane"
brew "ffmpeg"
brew "git"
brew "rbenv"
brew "stow"
brew "tree"
brew "tmux"
brew "watchman"
brew "wget"
brew "yarn"
brew "zoxide"
brew "fluttergen/tap/fluttergen"
brew "leoafarias/fvm/fvm"
brew "mas"

# Neovim stuffs
brew "fzf"
brew "fd""
brew "lazygit"
brew "neovim"
brew "ripgrep"

# Cask
cask "alacritty"                        # Terminal
cask "maccy"                            # Clipboard manager
cask "google-chrome"
cask "visual-studio-code"
cask "font-jetbrains-mono-nerd-font"
cask "android-studio"
cask "spotify"
cask "steam"
cask "obsidian"
cask "cloudflare-warp"
cask "evkey"

# Mac App Store
mas "Xcode", id: 497799835
mas "The Unarchiver", id: 425424353
mas "Things 3", id: 904280696
mas "Magnet", id: 441258766
mas "DevCleaner for Xcode", id: 1388020431

