tap "adoptopenjdk/openjdk"
tap "dart-lang/dart"
tap "facebook/fb"
tap "felangel/mason"
tap "fluttergen/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "leoafarias/fvm"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Easiest way to build and release mobile apps
brew "fastlane"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Simple terminal UI for git commands
brew "lazygit"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Ruby version manager
brew "rbenv"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# A command-line tool for The Flutter code generator for your assets, fonts, colors, … — Get rid of all String-based APIs. by Dart.
brew "fluttergen/tap/fluttergen"
# Simple cli to manage Flutter SDK versions per project
brew "leoafarias/fvm/fvm"
# GPU-accelerated terminal emulator
cask "alacritty"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# Clipboard manager
cask "maccy"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin@19"
mas "DevCleaner", id: 1388020431
mas "Magnet", id: 441258766
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "Xcode", id: 497799835
